# Задача 1. Напишите программу, которая принимает на
# вход цифру, обозначающую день недели, и выводит
# название этого дня недели.
num = int(input('Введите день недели: '))
if num < 6:
    print()
